<?php

return [
    'pos' => 'លក់ទំនិញ',
    'my_account' => 'គណនី',
    'change_password' => 'ផ្លាស់ប្តូរពាក្យសម្ងាត់',
    'logout' => 'ចាកចេញ',
    'signed_in_as' => 'អ្នកប្រើប្រាស់គណនីឈ្មោះ',
    'administrator' => 'អ្នកគ្រប់គ្រង',
    'no_stock_alerts' => 'មិនមានការអស់ទំនិញឡើយ!!! អ្វីគ្រប់យ៉ាងល្អ!',
    'failed_to_load_notifications' => 'ការលោតសាត្រូវបានបរាជ័យ។ សូមព្យាយាមម្តងទៀតពេលក្រោយ។',
    'loading_alerts' => 'កំពុងលោតសារ...',

    // Sidebar Menu Keys
    'dashboard' => 'ផ្ទាំងដើម',
    'category' => 'ប្រភេទផលិតផល',
    'product' => 'ផលិតផល',
    'customer' => 'អតិថិជន',
    'supplier' => 'អ្នកផ្គត់ផ្គង់',
    'purchase' => 'ការទិញចូល',
    'order' => 'ការលក់',
    'permission' => 'សិទ្ធិប្រើប្រាស់',
    'report' => 'របាយការណ៍',
    'user' => 'អ្នកប្រើប្រាស់',
    'backup' => 'ការបម្រុងទុក',
    'setting' => 'ការកំណត់',
    'stock' => 'ស្ដុក',
    'pending' => 'មិនទាន់សម្រេច',
    'complete' => 'សម្រេច',
    'pending_due_sale' => 'អតិថិជនដែលជំពាក់',
    'all_roles' => 'តួនាទី',
    'roles_in_permission'=> 'ការផ្ដល់សិទ្ធទៅកាន់តួនាទី',
    'all_roles_in_permission'=> 'សិទ្ធរបស់តួនាទី',

    // ក្បាល Table
    'table_no' => 'ល.រ',
    'show' => 'បង្ហាញ',
    'table_created' => 'បង្កើតនៅថ្ងៃ',
    'table_action' => 'សកម្មភាព',
    'search' => 'ស្វែងរក...',
    'save'=> 'រក្សាទុក',
    'notes' => 'ការកត់ចំណាំ',
    'email' => 'អ៊ីមែល',
    'phone' => 'លេខទូរស័ព្ទ',
    'name' => 'ឈ្មោះ',
    'image' => 'រូបភាព​​',
    'all' => 'ទាំងអស់',

// ================= Category =====================
        // Category Page
            'product_category' => 'បន្ថែមប្រភេទផលិតផល',
            'add_category' => 'បន្ថែមប្រភេទផលិតផល',
            'search_for_category' => 'ស្វែងរក...',
            'table_category_name' => 'ឈ្មោះប្រភេទផលិតផល',
            'table_category_slug' => 'ស្លាក (Slug)',
            // Add Category
            'category_name' => "ឈ្មោះប្រភេទផលិតផល",
            // Edit Category
            'edit_category' => "កែប្រែឈ្មោះប្រភេទផលិតផល",
        // Notification Messages
        'category_inserted_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'category_updated_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានកែប្រែដោយជោគជ័យ',
        'category_deleted_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានលុបដោយជោគជ័យ',
        'category_delete_error_has_products' => 'មិនអាចលុបឈ្មោះនៃប្រភេទនេះបានទេ ព្រោះមានផលិតផលកំពុងប្រើប្រាស់ឈ្មោះនៃប្រភេទផលិតផលនេះ',

// ===================== Customer ======================================
        // List Customer
        'add_customer' => 'បន្ថែមអតិថិជន',
        'customer_name' => 'ឈ្មោះអតិថិជន',
        'customer_phone' => 'លេខទូរស័ព្ទអតិថិជន',
        'customer_address' => 'អាស័យដ្ឋានអតិថិជន',
        // Edit
        'edit_customer' => 'កែប្រែអតិថិជន',

        // Notification Messages
        'customer_inserted_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'customer_update_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានកែប្រែដោយជោគជ័យ',
        'customer_delete_error_has_related_records_exist' => 'មិនអាចលុបទិន្នន័យអតិថិជនម្នាក់នេះបានទេ ព្រោះអតិថិជននេះធ្លាប់ធ្វើការបញ្ជារទិញផលិតផល',
        'customer_deleted_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានលុបដោយជោគជ័យ',

// ===================== Supplier =======================================
        // List Supplier
        'suppier_name' => 'ឈ្មោះអ្នកផ្គត់ផ្គង់',
        'add_supplier' => 'បន្ថែមអ្នកផ្គត់ផ្គង់',
        'edit_supplier'=> 'កែប្រែអ្នកផ្គត់ផ្គង់',

        // Notification
        'supplier_inserted_successfully'=> 'ទិន្នន័យអ្នកផ្គត់ផ្គង់ត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'supplier_updated_successfully'=> 'ទិន្នន័យអ្នកផ្គត់ផ្គង់ត្រូវបានកែប្រែដោយជោគជ័យ',
        'supplier_can_not_delete' => 'ទិន្នន័យអ្នកផ្គត់ផ្គង់មិនអាចលុបបានទេ ព្រោះអ្នកផ្គត់ផ្គង់នេះធ្លាប់ធ្វើការលក់ផលិតផលដល់យើង',
        'supplier_delete_successfully' => 'ទិន្នន័យអ្នកផ្គត់ផ្គង់លុបដោយជោគជ័យ',

// ===================== Product ========================================
        // List Product
            'product_code'=> 'កូដផលិតផល',
            'product_name'=> 'ឈ្មោះផលិតផល',
            'price'=> 'តម្លៃ',
            'inventory'=> 'ចំនួនក្នុងស្ដុក',
            // Button List Product
            'import'=>'នាំចូល',
            'export'=>'នាំចេញ',

            'add_product'=>'បន្ថែមផលិតផល',
            'select_category'=> 'ជ្រើសរើសប្រភេទផលិតផល',
            'select_supplier'=> 'ជ្រើសរើសអ្នកផ្គត់ផ្គង់',
            'details'=> 'ព័ត៌មានបន្ថែម',
            'choose_file' => 'ជ្រើសរើរូបភាព',
            'no_file_chosen' => 'មិនទាន់មានឯកសាររូពភាព',
            'buy_price' => 'តម្លៃទិញចូល',
            'stock_alert' => 'ចំនួនផលិតផលដែលត្រូវលោតសារពេលជិតអស់ពីឃ្លាំង',
            // jQuery Validation Messages
            'please_enter_product_name' => 'ឈ្មោះផលិតផលតម្រូវអោយបញ្ចូល',
            'please_select_category' => 'សូមជ្រើសរើសប្រភេទនៃឈ្មោះផលិតផល',
            'please_select_supplier' => 'សូមជ្រើសរើសឈ្មោះអ្នកផ្គត់ផ្គង់',
            'please_enter_price_selling_price' => 'តម្លៃផលិតផលតម្រូវអោយបញ្ជូល',
            'please_enter_inventory' => 'ចំនួនផលិតផលក្នុងឃ្លាំងតម្រូវអោយបញ្ចូល',
            'please_enter_stock_alert' => 'ចំនួនផលិតផលដែលត្រូវលោតសារពេលជិតអស់ពីឃ្លាំង តម្រូវអោយបញ្ចូល',
            'please_enter_buying_price' => 'តម្លៃទិញចូល តម្រូវអោយបញ្ចូល',
            // Message
            'product_inserted_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានបញ្ចូលដោយជោគជ័យ',
            'product_updated_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានកែប្រែដោយជោគជ័យ',
            'cannot_delete_product' => 'ទិន្នន័យផលិតផលមិនអាចលុបបានទេ ព្រោះផលិតផលនេះធ្លាប់ត្រូវបានគេបញ្ជារទិញឬយើងបញ្ជាទិញពីអ្នកផ្គត់ផ្គង់',
            'product_deleted_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានលុបដោយជោគជ័យ',
            // Edit Page
            'edit_product'=> 'កែប្រែផលិតផល',
            // BarCode
            'barcode'=> 'លេខកូដសម្គាល់',
            // Product View
            'product_details'=> 'ព័ត៌មានផលិតផល',
            // Import Product Page
            'import_product'=> 'ផលិតផលនាំចូល',
            'download_excell'=> 'ទាញយកជាExcell',
            'excell_file_import'=> 'នាំចូលជាឯកសាប្រភេទExcell',
            'upload'=> 'ធ្វើការបញ្ជូន',


// ===================== Purchase ========================================
        // Purchase Pending
        'pending_purchase_orders'=> 'ការបញ្ជាទិញដែលមិនទាន់សម្រេច',
        'create_purchase'=>'បង្កើតការបញ្ជាទិញ',
        'supplier_name'=>'ឈ្មោះអ្នកផ្គត់ផ្គង់',
        'purchase_date'=>'ថ្ងៃបញ្ជាទិញ',
        'payment'=>'ការទូទាត់',
        'invoice'=>'វិក្កយបត្រ',
        'pay'=>'ទឹកប្រាក់ដែលបង់',
        'status'=>'ស្ថានភាព',
        // Purchase Details
        'purchase_details'=>'ព័ត៌មានលម្អិតនៃការបញ្ជាទិញ',
        'payment_status'=> 'បង់ប្រាក់តាមរយៈ',
        'paid_amount'=> 'ចំនួនទឹកប្រាក់ដែលបានបង់',
        'due_amount'=> 'ចំនួនទឹកប្រាក់ដែលនៅសល់មិនទាន់បង់',
        'no'=>'ល.រ',
        'qty'=>'ចំនួន',
        'subtotal'=>'តម្លៃ',
        'total'=>'តម្លៃសរុប',
        'complete_purchase'=>'បញ្ជាក់ការបញ្ជារទិញ',
        // Create Purchase
        'all_category' => 'ប្រភេទនៃផលិតផលទាំងអស់',
        'purchase_cart' => 'ផលិតផលបំរុងធ្វើទិញ',
        'total_payable'=> 'ប្រាក់ត្រូវបង់',
        'payment_method'=> 'បង់ប្រាក់តាមរយៈ',
        'pay_now'=> 'ចំនួនទឹកប្រាក់ដែលត្រូវបង់',
        'discount'=> 'បញ្ចុះតម្លៃ',
        'select_payment'=> 'ជ្រើសរើសប្រភេទនៃការបង់ប្រាក់',
        'please_select_payment_status'=>'សូមជ្រើសរើសវិធីបង់ប្រាក់',
        'input_pay_now'=>'សូមបញ្ចូលចំនួនទឹកប្រាក់ដែលត្រូវបង់',
        // Notification
        'please_select_product_for_purchase' => 'សូមជ្រើសរើសផលិតផលមុនធ្វើការបញ្ជាទិញ',
        'purchase_completed_successfully' => 'ការបញ្ជាទិញជោគជ័យ',
        'purchase_done_successfully' => 'ការបញ្ជាក់ការបញ្ជារទិញជោគជ័យ',
        'due_amount_updated_successfully' => 'ប្រាក់ជំពាក់បានកែប្រែជោគជ័យ',
        'discount_cannot_exceed_subtotal' => 'អ្នកមិនអាចធ្វើការបញ្ចុះតម្លៃស្នើឬសើសតម្លៃសរុបបានទេ',
        // Purchase Complete Page
        'complete_purchases'=>'ការបញ្ជាទិញដែលជោគជ័យ',
        // Purchase Due Page
        'purchase_pending_due'=> 'ប្រាក់ជំពាក់ក្នុងការបញ្ជាទិញ',
        'due'=>'ប្រាក់ជំពាក់',
        'purchase_pay_due_amount'=> 'ប្រាក់ដែលត្រូវបង់',
        // Purchase Modal
        'add_new_supplier'=> 'បន្ថែមអ្នកផ្គត់ផ្គង់ថ្មី',
        'cancel'=> 'បោះបង់',
        'errors'=> 'មានបញ្ហា',
        'add_new_product' => 'បន្ថែមផលិតផលថ្មី',
        'cost' => 'តម្លៃដើម',
        'invoice_no'=> 'លេខវិក្ដយបត្រ',
        'enter_invoice_no'=> 'សូមបញ្ចូលលេខវិក្ដយបត្រ',

// ============== Order ==================================
        // Pending Orders
        'pending_orders'=> 'ការបញ្ជាទិញដែលមិនទាន់សម្រេច',
        'order_date'=> 'ថ្ងៃបញ្ជាទិញ',
        'order_invoice'=> "វិក័យប័ត្របញ្ជាទិញ",
        'complete_order'=> 'បញ្ជាក់ការបញ្ជាទិញ',
        'complete_orders'=> 'ការបញ្ជាទិញដែលជោគជ័យ',
        // Pending Due Page
        'pending_due'=> 'មិនទាន់បង់ប្រាក់គ្រប់',
        'pay_due_amount'=> 'ចំនួនទឹកប្រាក់ដែលត្រូវបង់',
        'order_details'=> 'ព័ត៌មានលម្អិតនៃការបញ្ជាទិញ',
        // Notification 
        'order_complete_successfully' => 'ការបញ្ជាទិញជោគជ័យ',
        'stock_not_enough_for_the_product' => 'ផលិតផលមានមិនគ្រប់គ្រាន់ដើម្បីលក់ទេ',
        'order_done_successfully' => 'ការបញ្ជាទិញជោគជ័យ',

//======================  POS ===============================================
        // Pos page
        'product_items'=>'ផលិតផលបំរុងនឹងលក់ជូនអតិថិជន',
        'pay_nows'=> 'បញ្ជូនការលក់',
        'no_items_in_cart'=>'អ្នកមិនទាន់បានជ្រើសរើសផលិតផល',
        'select_customer'=>'សូមជ្រើសរើសឈ្មោះអតិថិជន',
        'please_select_customer'=> 'សូមជ្រើសរើសឈ្មោះអតិថិជន',

        // Notification
        'you_mout_add_product_to_cart' => 'សូមជ្រើសរើសផលិតផលមុនបញ្ជាទិញ',
        'not_enough_stock_for_product'=>'ចំនួនផលិតផលក្នុងឃ្លាំងមិនគ្រប់គ្រាន់ដើម្បីលក់ឡើយ',
        'something_went_wrong'=>'មានអ្វីមួយមិនដំណើរការបាន',
        // Modal Add New Customer
        'add_new_customer' => 'បន្ថែមអតិថិជនថ្មី',
        'address'=> 'អាសយដ្ឋាន',

        'order_type'=> 'ប្រភេទនៃការទិញ',

// ====================== Permision ==============================================
        // Pemision Page
        'permissions'=>'ការផ្ដល់សិទ្ធដល់អ្នកប្រើប្រាស់',
        'permission_name'=>'សិទ្ធអាចចូលប្រើចំណុចណាមួយ',
        'group_name'=>'ក្រុមបណ្ដុំនៃសិទ្ធ',
        'add_permission'=> 'បន្ថែមមុខងារនៃសិទ្ធ',
        'select_group_name'=> 'ជ្រើសរើសបណ្ដុំនៃសិទ្ធ',
        'edit_permission'=>'ការកែប្រែសិទ្ធ',
        // Validateion
        'please_enter_permission_name'=>'សូមបញ្ចូលសិទ្ធ',
        'please_select_group_name'=>'សូមជ្រើសរើសបណ្ដុំនៃសិទ្ធ',
        // Notification
        'permission_added_successfully' => 'បន្ថែមសិទ្ធថ្មីបានជោគជ័យ',
        'permission_updated_successfully' => 'ការកែប្រែសិទ្ធបានជោគជ័យ',
        'permission_deleted_successfully' => 'ការលុបសិទ្ធបានជោគជ័យ',
        'permission_name_already_exists'=>'សិទ្ធនេះអ្នកបានបញ្ចូលម្ដងហើយ សូមបញ្ចូលម្ដងទៀតកុំអោយដូចសិទ្ធចាស់',
        'permission_in_use_error' => 'សិទ្ធនេះមិនអាចលុបទេព្រោះបានមានអ្នកប្រើប្រាស់កំពុងប្រើសិទ្ធនេះ',
// ======================= Role ===========================
        // List Role
        'roles'=> 'តួនាទី',
        'add_roles'=>'បន្ថែមតួនាទី',
        'select_roles'=> 'ជ្រើសរើសតួនាទី',
        'please_select_role_name'=> 'សូមជ្រើសរើសតួនាទី',
        // Validation
        'please_enter_a_role_name'=>'សូមបញ្ចូលតួនាទី តម្រូវអោយបញ្ចូល',
        'roles_name_already_exists'=> 'តួនាទីនេះមានហើយ សូមបញ្ចូលតួនាទីថ្មី',
        // Edit Role Page
        'edit_roles'=>'កែប្រែតួនាទី',
        // Notification
        'role_updated_successfully' => 'តួនាទីត្រូវបានកែប្រែជោគជ័យ',
        'cannot_delete_this_roles_have_user_use_this_role' => 'មិនអាចលុបតួនាទីនេះព្រោះមានអ្នកប្រើប្រាស់កំពុងស្ថិតក្នុងតួនាទីមួយនេះ',
        'role_deleted_successfully' => 'តួនាទីត្រូវបានលុបជោគជ័យ',
        'role_added_successfully' => 'ការបន្ថែមតួនាទីជោគជ័យ',


// ==================== =====================================

        // Add Roles Permission Page
        'add_roles_permission'=>'បន្ថែមសិទ្ធទៅដល់តួនាទីណាមួយ',
        'all_permission'=>'សិទ្ធទាំងអស់',
        'purchases'=> 'បញ្ជាទិញ',
        'orders'=> 'ការបញ្ជាលក់',

        // អតិថិជន (Customer)
        'customer.menu' => 'ម៉ឺនុយអតិថិជន',
        'customer.all' => 'អតិថិជនទាំងអស់',
        'customer.add' => 'បន្ថែមអតិថិជន',
        'customer.edit' => 'កែប្រែអតិថិជន',
        'customer.delete' => 'លុបអតិថិជន',

        // ការលក់នៅកន្លែង (POS)
        'pos.menu' => 'ម៉ឺនុយការលក់',

        // អ្នកផ្គត់ផ្គង់ (Supplier)
        'supplier.menu' => 'ម៉ឺនុយអ្នកផ្គត់ផ្គង់',
        'supplier.all' => 'អ្នកផ្គត់ផ្គង់ទាំងអស់',
        'supplier.add' => 'បន្ថែមអ្នកផ្គត់ផ្គង់',
        'supplier.edit' => 'កែប្រែអ្នកផ្គត់ផ្គង់',
        'supplier.delete' => 'លុបអ្នកផ្គត់ផ្គង់',

        // ប្រភេទទំនិញ (Category)
        'category.menu' => 'ម៉ឺនុយប្រភេទទំនិញ',
        'category.all' => 'ប្រភេទទំនិញទាំងអស់',
        'category.add' => 'បន្ថែមប្រភេទទំនិញ',
        'category.edit' => 'កែប្រែប្រភេទទំនិញ',
        'category.delete' => 'លុបប្រភេទទំនិញ',

        // ផលិតផល (Product)
        'product.menu' => 'ម៉ឺនុយផលិតផល',
        'product.all' => 'ផលិតផលទាំងអស់',
        'product.add' => 'បន្ថែមផលិតផល',
        'product.edit' => 'កែប្រែផលិតផល',
        'product.delete' => 'លុបផលិតផល',
        'product.import' => 'នាំចូលផលិតផល',
        'product.export' => 'នាំចេញផលិតផល',
        'product.details' => 'ព័ត៌មានលម្អិតផលិតផល',
        'product.barcode' => 'បាកូដផលិតផល',

        // ការสั่งซื้อ (Order)
        'order.menu' => 'ម៉ឺនុយការបញ្ជាការលក់',
        'order.complete' => 'ការលក់ជោគជ័យ',
        'order.pending' => 'ការលក់មិនទាន់ជោគជ័យពេញលេញ',
        'order.pending.due' => 'អតិថិជនជំពាក់ប្រាក់',

        // តួនាទី (Role)
        'role.menu' => 'ម៉ឺនុយតួនាទី',

        // ការបញ្ជាទិញ (Purchase)
        'purchase.menu' => 'ម៉ឺនុយការបញ្ជាទិញ',
        'purchase.complete' => 'ការបញ្ជាទិញបានបញ្ចប់',
        'purchase.pending.due' => 'ការបញ្ជាទិញជំពាក់',
        'purchase.pending' => 'ការបញ្ជាទិញមិនទាន់សម្រេច',
        'purchase.add' => 'បន្ថែមការបញ្ជាទិញ',

        // អ្នកប្រើប្រាស់ (User)
        'user.menu' => 'ម៉ឺនុយអ្នកប្រើប្រាស់',
        'user.all' => 'អ្នកប្រើប្រាស់ទាំងអស់',
        'user.add' => 'បន្ថែមអ្នកប្រើប្រាស់',
        'user.edit' => 'កែប្រែអ្នកប្រើប្រាស់',
        'user.delete' => 'លុបអ្នកប្រើប្រាស់',

        // សិទ្ធិ (Permission)
        'permission.menu' => 'ម៉ឺនុយសិទ្ធិ',

        // ការបម្រុងទុក (Backup)
        'backup.menu' => 'ម៉ឺនុយការបម្រុងទុក',

        // របាយការណ៍ (Report)
        'report.menu' => 'ម៉ឺនុយរបាយការណ៍',
        'report.purchase' => 'របាយការណ៍ការបញ្ជាទិញ',
        'report.expense' => 'របាយការណ៍ចំណាយ',
        'report.sale' => 'របាយការណ៍ការលក់',
        'report.stock' => 'របាយការណ៍ឃ្លាំង',

        // Role And Permission
        'permission_roler_already' => 'សិទ្ធក្នុងតួនាទីនេះមានរួចហើយ',
        'role_permission_added_successfully' => 'ការបន្ថែមសិទ្ធដល់តួនាទីជោគជ័យ',
        'role_permission_updated_successfully'=> 'ការកែប្រែសិទ្ធដល់តួនាទីជោគជ័យ',
        'cannot_delete_this_role' => 'មិនអាចលុបតួនាទីមួយនេះទេ ព្រោះមានអ្នកប្រើប្រាស់កំពុងស្ថិតក្នុងតួនាទីនេះ!! ដោយមាន',
        'all_roles_permission'=> 'សិទ្ធនឹងតួនាទី',
        'add_role_in_permission'=> 'បន្ថែមសិទ្ធដល់តួនាទី',

// ========================= Report ====================================================
        // Order Report
                'orders_report' => 'របាយការណ៍ការលក់',
                'by_day' => 'តាមថ្ងៃ',
                'by_month' => 'តាមខែ',
                'by_year' => 'តាមឆ្នាំ',
                'total_revenue' => 'ប្រាក់ចំណូលសរុប',
                'total_orders' => 'បញ្ជាទិញសរុប',
                'items_sold' => 'ផលិតផលដែលបានលក់',
                'avg_order_value' => 'តម្លៃបញ្ជាទិញមធ្យម',
                'date' => 'កាលបរិច្ឆេទ',
                'amount' => 'ចំនួនទឹកប្រាក់',
                'total_amount' => 'ចំនួនទឹកប្រាក់សរុប',
        // របាយការណ៍ការទិញ
                'purchase_report' => 'របាយការណ៍ទិញផលិតផល',
                'purchases_report' => 'របាយការណ៍ទិញ',
                'total_spending' => 'ចំណាយសរុប',
                'total_purchases' => 'ការទិញសរុប',
                'items_purchased' => 'ផលិតផលដែលបានទិញ',
                'avg_purchase_value' => 'តម្លៃទិញមធ្យម',
                'sale_report' => 'របាយការណ៍លក់',
                'stock_report' => 'របាយការណ៍ស្ដុក',
                'incom_outcome_report' => 'របាយការណ៍ចំណូល',
        // របាយការណ៍ស្តុក
                'stock_movement_report' => 'របាយការណ៍ឃ្លាំងផលិតផលចេញចូល',
                'stock_movement_for' => 'ដំណើរការឃ្លាំងសម្រាប់',
                'total_stock_in' => 'ចំនួនផលិតផលចូលឃ្លាំងសរុប',
                'total_stock_out' => 'ចំនួនផលិតផលចេញឃ្លាំងសរុប',
                'opening_stock' => 'ចំនួនផលិតផលឃ្លាំងដើម',
                
                'stock_in' => 'ផលិតផលឃ្លាំងចូល',
                'stock_out' => 'ផលិតផលឃ្លាំងចេញ',
                'closing_stock' => 'បិទឃ្លាំងបញ្ចប់',
                'type_stock'=>'ផលិតផលចេញឬចូល',

        // Income & Outcome
        'income_expense_report' => 'របាយការណ៍ប្រាក់ចំណូល និងចំណាយ',
        'start_date' => 'ថ្ងៃចាប់ផ្ដើម',
        'end_date' => 'ថ្ងៃបញ្ចប់',
        'total_expenses' => 'ចំណាយសរុប',
        'profit_loss' => 'ប្រាក់ចំណេញ/ខាត',
        'income_details' => 'ព័ត៌មានលម្អិតអំពីប្រាក់ចំណូល',
        'expense_details' => 'ព័ត៌មានលម្អិតអំពីចំណាយ',

        // Month
        'start_month' => 'ខែចាប់ផ្ដើម',
        'end_month' => 'ខែបញ្ចប់',

        // Year
        'start_year' => 'ឆ្នាំចាប់ផ្ដើម',
        'end_year' => 'ឆ្នាំបញ្ចប់',
        'day'=> 'ថ្ងៃ',
        'month'=> 'ខែ',
        'year'=> 'ឆ្នាំ',     
        'total_expense'=>'ប្រាក់ចំណាយសរុប',  
        'report_for'=>'របាយការណ៏សម្រាប់', 
        


// ====================== User =======================
        // List user
        'all_user'=>'អ្នកប្រើប្រាស់ចំនួន',
        'add_user'=>'បន្ថែមអ្នកប្រើប្រាស់',
        // Add User
        'password'=>'ពាក្យសម្ងាត់',
        'edit_user'=>'កែប្រែពត៌មានអ្នកប្រើប្រាស់',
        // Notification
        'user_updated_successfully' => 'កែប្រែពត៌មានអ្នកប្រើប្រាស់បានជោកជ័យ',
        'logout_successfully' => 'ចេញប្រព័ន្ធដំណើរការជោគជ័យ',
        'login_successfully' => 'ចូលប្រព័ន្ធដំណើរការជោគជ័យ',
        'profile_updated_successfully' => 'ពត៌មានអ្នកកែប្រែដោយជោគជ័យ',
        'old_password_doest_match' => 'លេខសម្ងាត់នេះមិនត្រូវលេខសម្ងាត់ចាស់របស់អ្នកឡើយ',
        'password_change_success' => 'ពាក្យសម្ងាត់ត្រូវបានផ្លាស់ប្ដូរជោគជ័យ',
        'new_user_created_successfully'    => 'ការបង្កើតអ្នកប្រើប្រាស់ថ្មីជោគជ័យ',
        'user_delete_successfully' => 'អ្នកបានលុបគណនីអ្នកប្រើប្រាស់ជោគជ័យ',

        // Validate add & edit
        'user_name'=>'សូមបញ្ចូលឈ្មោះអ្នកប្រើប្រាស់',
        'please_enter_password'=>'សូមបញ្ចូលពាក្យសម្ងាត់',
        'please_enter_rolesl'=>'សូមបញ្ជូលតួនាទីរបស់អ្នកប្រើប្រាស់',
        'please_enter_email'=>'សូមបញ្ចូលអ៊ីមែល',
        'please_enter_phone'=>'សូមបញ្ចូលលេខទូរស័ព្ទ', 
        
// ================== Bakcup Page ======================
        // Backup DB
        'backup_management'=>'ការគ្រប់គ្រងលើការបំរុងទុក',
        'file_name'=>'ឈ្មោះឯកសា',
        'size'=>'ទំហំ',
        'path'=>'ទីតាំង',
        'action'=>'សកម្មភាព',
        'backup_database_now'=>'ធ្វើការបំរុងទុកទិន្នន័យដាតាបេស',
        'database'=>'ដាតាបេស',
        'backup_project_file_now'=>'បំរុងទុកលើឯកសារនៃគម្រោង',
        'project'=>'គម្រោង',

// ==================== Stock Alert =====================
        'a_t'=>'ប្រភេទការកែតម្រូវ',
        'quantity'=> 'ចំនួន',
        'notes_reason'=> 'កត់ចំណាំ (ហេតុផលនៃការកែតម្រូវ)',
        'in_stock'=>'ផលិតផលមានក្នុងឃ្លាំង',
        'alert_threshold'=>'ចំនួនផលិតផលដែលត្រូវលោត',

// ================== Profile ============================
        'personal_info'=> 'ព័ត៌មានរបស់អ្នក',
        'user_profile_image'=> 'រូបភាពរបស់អ្នក',
        'no_file_chosse'=> 'អ្នកមិនទាន់បានជ្រើសរើសរូបភាពទេ',
        'chosse_file'=> 'ជ្រើសរើសរូបភាព',
        'edit'=> 'កែប្រែដោយរក្សាទុក',

// =============== Change Password =======================
        'old_password'=>'លេខកូដសម្ងាត់ចាស់',
        'new_password'=>'លេខកូដសម្ងាត់ថ្មី',
        'confirm_password'=>'បញ្ជាក់លេខកូដសម្ងាត់ថ្មី',
        'no_stock_alert'=>'ផលិតផលនៅក្នុងឃ្លាំងគឺល្អ អត់មានផលិតផលណាជិតអស់ឡើយ!',


// ======================= Condition =========================
        'condition_name' => 'ឈ្មោះលក្ខខណ្ឌ',
        'condition' => 'ផលិតផលថ្មីឬចាស់',
        'add_condition' => 'បន្ថែមលក្ខណៈផលិតផលថ្មីឬចាស់',
        'edit_condition' => 'កែប្រែលក្ខណៈផលិតផលថ្មីឬចាស់',
        // Notification 
        'condition_updated_successfully' => 'ការកែប្រែ លក្ខណៈផលិតផលថ្មីឬចាស់បានជោគជ័យ',
        'condition_inserted_successfully' => 'ការបន្ថែម លក្ខណៈផលិតផលថ្មីឬចាស់បានជោគជ័យ',
        'condition_delete_error_has_products' => 'ការលុបមិនអាចទៅរួចទេ ព្រោះមានផលិតផលណាមួយកំពុងប្រើលក្ខណៈផលិតផលថ្មីឬចាស់',
        'condition_deleted_successfully'=> 'ការលុប លក្ខណៈផលិតផលថ្មីឬចាស់បានជោគជ័យ',
        'please_select_condition'=> 'សូមជ្រើសរើសលក្ខណៈនៃផលិតផល',
        // Validate
        'select_condition'=> 'ជ្រើសរើសលក្ខណៈនៃផលិតផល',

// ================================= Seting ===========================
        'information_shop'=> 'ពត៌មានហាង',
        'information_invoice' => 'ព័ត៌មានវិក្កយបត្រ',





// ================================ ចំណុចរាយរង​======================
        'no_sales_data_abailable'=> 'គ្មានទិន្នន័យចំណូល',
        'no_expense_data'=> 'គ្មានទិន្នន័យចំណាយ',
        'no_purchases'=> 'គ្មានទិន្នន័យការបញ្ជាទិញ',
        'no_order' => 'គ្មានទិន្នន័យលក់',
        'total_order'=>'សរុបការលក់',
        'close'=> 'បិទ',
        'shop_name_kh'=> 'ឈ្មោះរបស់ហាងភាសាខ្មែរ',
        'shop_name_en'=> 'ឈ្មោះរបស់ហាងជាភាសាអង់គ្លេស',
        'terms_and_condition'=> 'លក្ខខណ្ឌ',
        'logo'=> 'ផ្លាកយីហោ',
        'choose'=> 'ជ្រើសរើស',
        'total_pre_orders'=> 'សរុបការកម្មង់ទិញ',


        'condition.all'=> 'លក្ខខណៈទាំងអស់',
        'condition.add'=> 'បន្ថែមលក្ខខណៈ',
        'condition.edit'=> 'កែប្រែលក្ខខណៈ',
        'condition.delete'=> 'លុបលក្ខខណៈ',
        'order.pending.pre.order'=> 'ការកម្មង់ទិញរបស់អតិថិជន',
        'setting.menu'=> 'មុឺនុយការកំណត់',
        'stock.menu'=> 'មុឺនុយស្ដុក',

        'today_is_revenue'=> 'ប្រាក់ចំណូលថ្ងៃនេះ',
        'this_year_is_revenue'=>'ប្រាក់ចំណូលឆ្នាំនេះ',
        'vs_yesterday'=>'ធៀបនឹងម្សិលមិញ',
        'total_for'=>'សរុបសម្រាប់',
        'all_time_completed'=>'ការបញ្ជាទិញដែលសម្រេចតាំងពីដំដើមមក',
        'sales_trend_last_30_days'=>'ការលក់ ៣០ថ្ងៃចុងក្រោយ',
        'top5_best_selling_products'=>'ចំនួនផលិតផលទាំង5ដែលលក់ដាច់ជាងគេ',
        'monthly_sales_trend'=>'ការលក់ក្នុងខែនីមួយៗក្នុងឆ្នាំ',
        'order_distribution'=>'ការបញ្ជាទិញ',
];      
