<?php

return [
    'pos' => 'លក់ទំនិញ',
    'my_account' => 'គណនី',
    'change_password' => 'ផ្លាស់ប្តូរពាក្យសម្ងាត់',
    'logout' => 'ចាកចេញ',
    'signed_in_as' => 'អ្នកប្រើប្រាស់គណនីឈ្មោះ',
    'administrator' => 'អ្នកគ្រប់គ្រង',
    'no_stock_alerts' => 'មិនមានការអស់ទំនិញឡើយ!!! អ្វីគ្រប់យ៉ាងល្អ!',
    'failed_to_load_notifications' => 'ការលោតសាត្រូវបានបរាជ័យ។ សូមព្យាយាមម្តងទៀតពេលក្រោយ។',
    'loading_alerts' => 'កំពុងលោតសារ...',

    // Sidebar Menu Keys
    'dashboard' => 'ផ្ទាំងគ្រប់គ្រង',
    'category' => 'ប្រភេទផលិតផល',
    'product' => 'ផលិតផល',
    'customer' => 'អតិថិជន',
    'supplier' => 'អ្នកផ្គត់ផ្គង់',
    'purchase' => 'ការទិញចូល',
    'order' => 'ការលក់',
    'permission' => 'សិទ្ធិប្រើប្រាស់',
    'report' => 'របាយការណ៍',
    'user' => 'អ្នកប្រើប្រាស់',
    'backup' => 'ការបម្រុងទុក',

    // ក្បាល Table
    'table_no' => 'ល.រ',
    'show' => 'បង្ហាញ',
    'table_created' => 'បង្កើតនៅថ្ងៃ',
    'table_action' => 'សកម្មភាព',
    'search' => 'ស្វែងរក...',
    'save'=> 'រក្សាទុក',
    'notes' => 'ការកត់ចំណាំ',
    'email' => 'អ៊ីមែល',
    'phone' => 'លេខទូរស័ព្ទ',
    'name' => 'ឈ្មោះ',
    'image' => 'រូបភាព​​',

    // ================= Category =====================
        // Category Page
            'product_category' => 'បន្ថែមប្រភេទផលិតផល',
            'add_category' => 'បន្ថែមប្រភេទផលិតផល',
            'search_for_category' => 'ស្វែងរកប្រភេទផលិតផល...',
            'table_category_name' => 'ឈ្មោះប្រភេទផលិតផល',
            'table_category_slug' => 'ស្លាក (Slug)',
            // Add Category
            'category_name' => "ឈ្មោះប្រភេទផលិតផល",
            // Edit Category
            'edit_category' => "កែប្រែឈ្មោះប្រភេទផលិតផល",
        // Notification Messages
        'category_inserted_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'category_updated_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានកែប្រែដោយជោគជ័យ',
        'category_deleted_successfully' => 'ឈ្មោះនៃប្រភេទផលិតផលត្រូវបានលុបដោយជោគជ័យ',
        'category_delete_error_has_products' => 'មិនអាចលុបឈ្មោះនៃប្រភេទនេះបានទេ ព្រោះមានផលិតផលកំពុងប្រើប្រាស់ឈ្មោះនៃប្រភេទផលិតផលនេះ',

    // ===================== Customer ======================================
        // List Customer
        'add_customer' => 'បន្ថែមអតិថិជន',
        'customer_name' => 'ឈ្មោះអតិថិជន',
        'customer_phone' => 'លេខទូរស័ព្ទអតិថិជន',
        'customer_address' => 'អាស័យដ្ឋានអតិថិជន',
        // Edit
        'edit_customer' => 'កែប្រែអតិថិជន',

        // Notification Messages
        'customer_inserted_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'customer_update_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានកែប្រែដោយជោគជ័យ',
        'customer_delete_error_has_related_records_exist' => 'មិនអាចលុបទិន្នន័យអតិថិជនម្នាក់នេះបានទេ ព្រោះអតិថិជននេះធ្លាប់ធ្វើការបញ្ជារទិញផលិតផល',
        'customer_deleted_successfully' => 'ទិន្នន័យអតិថិជនត្រូវបានលុបដោយជោគជ័យ',

    // ===================== Supplier =======================================
        // List Supplier
        'suppier_name' => 'ឈ្មោះអ្នកផ្គត់ផ្គង់',
        'add_supplier' => 'បន្ថែមអ្នកផ្គត់ផ្គង់',
        'edit_supplier'=> 'កែប្រែអ្នកផ្គត់ផ្គង់',

        // Notification
        'supplier_inserted_successfully'=> 'ទិន្នន័យអ្នកផ្គត់ផ្គង់ត្រូវបានបញ្ចូលដោយជោគជ័យ',
        'supplier_updated_successfully'=> 'ទិន្នន័យអ្នកផ្គត់ផ្គង់ត្រូវបានកែប្រែដោយជោគជ័យ',
        'supplier_can_not_delete' => 'ទិន្នន័យអ្នកផ្គត់ផ្គង់មិនអាចលុបបានទេ ព្រោះអ្នកផ្គត់ផ្គង់នេះធ្លាប់ធ្វើការលក់ផលិតផលដល់យើង',
        'supplier_delete_successfully' => 'ទិន្នន័យអ្នកផ្គត់ផ្គង់លុបដោយជោគជ័យ',

    // ===================== Product ========================================
        // List Product
            'product_code'=> 'កូដផលិតផល',
            'product_name'=> 'ឈ្មោះផលិតផល',
            'price'=> 'តម្លៃ',
            'inventory'=> 'ចំនួនក្នុងឃ្លាំង',
            // Button List Product
            'import'=>'នាំចូល',
            'export'=>'នាំចេញ',

            'add_product'=>'បន្ថែមផលិតផល',
            'select_category'=> 'ជ្រើសរើសប្រភេទផលិតផល',
            'select_supplier'=> 'ជ្រើសរើសអ្នកផ្គត់ផ្គង់',
            'details'=> 'ព័ត៌មានបន្ថែម',
            'choose_file' => 'ជ្រើសរើរូបភាព',
            'no_file_chosen' => 'មិនទាន់មានឯកសាររូពភាព',
            'buy_price' => 'តម្លៃទិញចូល',
            'stock_alert' => 'ចំនួនផលិតផលដែលត្រូវលោតសារពេលជិតអស់ពីឃ្លាំង',
            // jQuery Validation Messages
            'please_enter_product_name' => 'ឈ្មោះផលិតផលតម្រូវអោយបញ្ចូល',
            'please_select_category' => 'សូមជ្រើសរើសប្រភេទនៃឈ្មោះផលិតផល',
            'please_select_supplier' => 'សូមជ្រើសរើសឈ្មោះអ្នកផ្គត់ផ្គង់',
            'please_enter_price_selling_price' => 'តម្លៃផលិតផលតម្រូវអោយបញ្ជូល',
            'please_enter_inventory' => 'ចំនួនផលិតផលក្នុងឃ្លាំងតម្រូវអោយបញ្ចូល',
            'please_enter_stock_alert' => 'ចំនួនផលិតផលដែលត្រូវលោតសារពេលជិតអស់ពីឃ្លាំង តម្រូវអោយបញ្ចូល',
            'please_enter_buying_price' => 'តម្លៃទិញចូល តម្រូវអោយបញ្ចូល',
            // Message
            'product_inserted_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានបញ្ចូលដោយជោគជ័យ',
            'product_updated_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានកែប្រែដោយជោគជ័យ',
            'cannot_delete_product' => 'ទិន្នន័យផលិតផលមិនអាចលុបបានទេ ព្រោះផលិតផលនេះធ្លាប់ត្រូវបានគេបញ្ជារទិញឬយើងបញ្ជាទិញពីអ្នកផ្គត់ផ្គង់',
            'product_deleted_successfully' => 'ទិន្នន័យផលិតផលត្រូវបានលុបដោយជោគជ័យ',
            // Edit Page
            'edit_product'=> 'កែប្រែផលិតផល',
            // BarCode
            'barcode'=> 'លេខកូដសម្គាល់',
            
];