<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines for Khmer
    |--------------------------------------------------------------------------
    */

    'required' => ':attribute តម្រូវឲ្យបំពេញ!!!',
    'unique'   => ':attribute នេះមានក្នុងប្រព័ន្ធគ្រប់គ្រងនេះរួចហើយ!!!',
    // បើមាន Rule ផ្សេងទៀតដែលអ្នកចង់បកប្រែ សូមដាក់នៅទីនេះ

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes for Khmer
    |--------------------------------------------------------------------------
    */

    'attributes' => [

        // =============== Category ================
        'category_name' => 'ឈ្មោះប្រភេទរបស់ផលិតផល',

        // =============== Customer ==============
        'name' => 'ឈ្មោះ',

        // =============== User ===================
        'email' => 'អុីមែល',
        'old_password'=> 'លេខកូដសម្ងាត់ចាស់',
        'new_password'=> 'លេខកូដសម្ងាត់ថ្មី',
        'condition_name'=> 'លក្ខណៈថ្មីឬចាស់',

    ],

];