<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines for Khmer
    |--------------------------------------------------------------------------
    */

    'required' => ':attribute តម្រូវឲ្យបំពេញ!!!',
    'unique'   => ':attribute នេះមានក្នុងប្រព័ន្ធគ្រប់គ្រងនេះរួចហើយ!!!',
    // បើមាន Rule ផ្សេងទៀតដែលអ្នកចង់បកប្រែ សូមដាក់នៅទីនេះ

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes for Khmer
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'category_name' => 'ឈ្មោះប្រភេទរបស់ផលិតផល',
        // បន្ថែម attribute ផ្សេងទៀតនៅទីនេះ ឧទាហរណ៍ 'email' => 'អ៊ីមែល'
    ],

];